# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input("Введите трехзначное число: "))
sum = number % 10 + (number//10) % 10 + number//100
print(f'Сумма цифр введенного числа: {sum}')
